/*
 * @author Elio Yang
 * @email  jluelioyang2001@gamil.com
 * @date 2021/3/10
 */

#ifndef PROBLEMSET_REGEX_DEF_H
#define PROBLEMSET_REGEX_DEF_H

//密码的强度必须是包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间。
#define pwd_eff "^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$"
//字符串必须是中文
#define must_zh "^[\\u4e00-\\u9fa5]{0,}$"
//由数字、26个英文字母或下划线组成的字符串
#define nwd "^\\w+$"
//身份证
#define id_15 "^[1-9]\\d{7}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}$"
#define id_18 "^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}([0-9]|X)$"
//校验日期
#define d_yyyy_mm_dd "^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$"
//两位小数
#define float_2 "^[0-9]+(.[0-9]{2})?$"





#endif //PROBLEMSET_REGEX_DEF_H
